{"config": [{"config": {"use_bias": true, "batch_input_shape": [null, 50, 50, 3], "activation": "relu", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "padding": "valid", "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_3", "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "dtype": "float32", "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_regularizer": null, "padding": "valid", "use_bias": true, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_4", "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_4", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "name": "dense_3", "activity_regularizer": null, "units": 128, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "use_bias": true, "name": "dense_4", "activity_regularizer": null, "units": 1, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow"}